{"meta":{"title":"Indra Kusuma","subtitle":"Student","description":"Seorang Mahasiswa Teknik Informatika UDINUS yang menyukai Web Development dan aktif sebagai aktivis kepemudaan FLS.","author":"Indra Kusuma","url":"https://idindrakusuma.github.io"},"pages":[{"title":"Tentang Indra Kusuma","date":"2017-06-08T13:15:23.000Z","updated":"2017-06-08T13:47:41.773Z","comments":true,"path":"About/index.html","permalink":"https://idindrakusuma.github.io/About/index.html","excerpt":"","text":"Hai Sobat ! Perkenalkan, saya Indra Kusuma biasa dipanggil “Indra” atau “Mas Indra”. Saat ini saya masih tercatat sebagai mahasiswa aktif jurusan Teknik Informatika (TI) Universitas Dian Nuswantoro Semarang. Saya merupakan seorang Web Developer, saya juga aktif diorganisasi Future Leader Summit. PendidikanPendidikan saya dimulai di MI Muhammadiyah 02 Rowosari, kemudian saya melanjutkan di SMP NU 09 Rowosari. Setelah itu, saya mengambil konsentrasi Teknik Komputer &amp; Jaringan di SMK Muhhamdiyah 03 Weleri dan Alkhamdulillah saya menjadi lulusan terbaik. dan saat ini saya masih memperjuangkan gelar sarjana komputer saya di Universitas Dian Nuswantoro Semarang. OrganisasiDari SMK, saya sudah aktif diberbagai Organisasi internal maupun ekternal dari kampus. Pengalaman organisasi saya dimulai di IPM (Ikatan Pelajar Muhammadiyah). Waktu itu jabatan tertinggi saya jadi Ketua Ilmu Pengetahuan dan Pengembangandan gebrakan saya waktu itu adalah menerbitkan majalah kampus di SMK Muhammadiyah 3 Weleri. Ditingkat pendidikan kampus, saya aktif diberbagai organisasi kampus baik Orma maupun UKM di Universitas Dian Nuwantoro (UDINUS). Saya pernah menjadi anggota aktif di HMTI (Himpunan Mahasiswa Teknik Informatika), Doscom (Dinus Open Source Community), DNCC (Dian Nuswantoro Computer Club) dan saat ini masih aktif sebagai Web Master di Future Leader Summit by Nusantara Muda. KemampuanSaya memiliki beberapa kemampuan, dan fokus saya di Web Development. saya menguasai PHP Codeigniter, Laravel, JavaScript, CSS, Wordpress dan berbagai CMS Blog seperti Blogger &amp; Hexo. Selain kemapuan web development, saya juga suka desain Presentasi dengan berbagai tools seperti Canva, Libre maupun Power point. Curiculum VitaeBisa donwload DISINI Informasi Kontak Whatsapp/Line/Telp/SMS/Telegram : +6289522248642 Email : indrakusuma.udinus@gmail.com ID LINE : indra.update Facebook : fb.com/id.indrakusuma Twitter : id_indrakusuma Instagram : @id.indrakusuma LinkedIn : https://www.linkedin.com/in/IDindrakusuma Github : https://github.com/idindrakusuma"}],"posts":[{"title":"Selamat Hari Santri Nasional yang Ke-2!","slug":"hari-santri","date":"2017-05-22T05:49:13.000Z","updated":"2017-06-09T06:07:34.351Z","comments":true,"path":"2017/05/22/hari-santri/","link":"","permalink":"https://idindrakusuma.github.io/2017/05/22/hari-santri/","excerpt":"22 Oktober merupakan Hari Santri Nasional bagi Negera Tercinta, Indonesia. Hal ini sesuai dengan keppres nomor 22 tahun 2015 tentang penetapan 22 oktober merukan Hari Santri Nasional. Nah, hari ini (22/10/2016) kami santri Pondok Raudhatul Qur’an Annasimiyyah memperingati Hari Santri Nasional dengan mengikuti serangkain acara yang diselenggarakan oleh Pemerintah Kota Semarang dan berbagai Ormas Islam diwilayah Semarang.","text":"22 Oktober merupakan Hari Santri Nasional bagi Negera Tercinta, Indonesia. Hal ini sesuai dengan keppres nomor 22 tahun 2015 tentang penetapan 22 oktober merukan Hari Santri Nasional. Nah, hari ini (22/10/2016) kami santri Pondok Raudhatul Qur’an Annasimiyyah memperingati Hari Santri Nasional dengan mengikuti serangkain acara yang diselenggarakan oleh Pemerintah Kota Semarang dan berbagai Ormas Islam diwilayah Semarang.Hari Santri ? Mengapa harus diperingati secara Nasional ? Kita semua tahu, bahwa lahirnya bangsa Indonesia tidak terlepas dari peran para ulama terdahulu, sebut saja K.H Hasyim Asyari, K.H Ahmad Dahlan dan para tokoh yang lain. Oleh karena itu, sudah sepantasnya kita memperingari hari santri. Terus, Kenapa pada 22 Oktober ? Hal tersebut merujuk pada peristiwa bersejarah yang membawa bangsa Indoensia meraih kemerdekaan dari para penjajah. Resolusi jihad yang dicetuskan oleh Pendiri NU KH. Hasyim Asy’ari pada tanggal 22 oktober tahun 1945 di Surabaya untuk mencegah kembalinya tentara kolonial belanda yang mengatasnamakan NICA. KH. Hasyim Asy’ari sebagai ulama pendiri NU menyerukan jihad dengan mengatakan bahwa “Membela tanah air dari penjajah hukumnya fardlu’ain atau wajib bagi setiap individu“. Oke, memangnya mas Indra Santri ? Kan udah saya tulis dipembukaan tadi, bahwa saya santri dari PPRQ Annasimiyyah dan diasuh Abah Hanif Ismail, LC. Jadi sudah jelas saya juga santri, hehehe. Oh iya ya, terus terus.. Mas Indra kan mahasiswa dan santri nih ? ceritain dong bagaimana prosesnya.. Nah ini nih yang paling penting, saya cerita sejarah saya sebelum mondok di PPRQ dulu ya. Sebenernya waktu awal kuliah dulu niatanya cuma pengen kuliah dan berorganisasi yang baik dan nyari sambilan buat bantuin orang tua bayar kuliah. Oleh karena itu dulu saya Ngekost, tapi ngekostnya cari yang bareng sama pekerja bukan sesama mahasiswa. Dulu ngekost 1 kamar dua orang yaitu saya dan teman saya Umam jadi bayarnya patungan gitu, Cuma si Umam disemester kedua tidak lanjut kuliah, dia lebih memilih wirausaha, nah waktu itu juga saya bingung nih, udah kuliah bayarnya mahal, ditambah biaya kost yang mahal yang harus ditanggung sendiri. Nah, waktu itu saya mau pindah terus cari yang murah - murah aja. yang bayarnya 200rb/bulan atau dibawahnya dan ketemulah si M Nurul Irfan, dia merupakan teman kelas sekaligus rekan komunitas DOSCOM. Dia memberitahu saya bahwa dia mondok di PPRQ dan biaya perbulanya cuma 60 ribu, masyaAllah murah banget kan. Waktu itu karena saya juga butuh yang murah saya langsung main dipondoknya irfan buat cek tempat. Tetapi saat saat pertama kali cek tempat, saya ngelus dada. Karena waktu itu satu kamar di isi 3 orang dan 4 sama saya. Tapi karena kebutuhan mendesak, udah mondok aja. Bismillah Dulu pas niat mau mondok ijin sama orang tua mas ? langsung dibolehin ? Dulu waktu mau mondok, bilang sama kedua orang tua malah langsung didukung. Cuma.. dulu posisinya saya masih hidup dizaman jahiliyah, ya saya dulu pacaran dan bangga (Astagfiruallah). Dulu dapet sendikit kontra nih sama mantan saya, tapi saya niat aja, bahwa saya juga sekalian mau perbaiki diri dan ngaji saya, jadi saya harus mondok. Dan Alkhamdulillah, setelah ngaji berbagai kitab fiqih, tafsir dan qur’an selama kurang dari 2 bulan, Saya diberi kekuatan sama Allah untuk berani memutuskan pacar saya (Alkhamdulillah..) Owalah.. nah terakhir nih mas. Kamu kan Aktivis juga nih, bagimana sih kondisi mahasiswa/pemuda Indonesia ? benarkah kekurangan orang pinter ? Wah pertanyaanya susah hehehe, tapi coba saya jawab dengan pengetahuan saya ya. Bismillah, jadi gini, Indonesia merupakan bangsa besar, sumber daya alam dan manusianya cukup habat. Kekurangan Orang pinter ? saya rasa tidak ! kamu bisa lihat berbagai kompetisi internasional, seperti fisika, matematika dan juaranya siapa ? Indonesia. Jadi untuk tingkat kepintaran, Indonesia jelas tidak kekurangan. Tapi, Indonesia kekurangan orang jujur dan beraklaq. Mereka yang korupsi jelas bukanlah orang bodoh. Mereka pintar dan sangat pintar tapi akhlaq dan iman mereka kosong ! nah, disini peran pendidikan agama sangatlah penting, oleh karena itu, tidak cukup belajar ilmu duniawi saja, harus belajar ilmu agama juga. Oleh karena itu,Santri yang notabenya ilmu agamanya baik, harus belajar ilmu duniawi yang baik juga, seperti yang dikatakan oleh Habib Luthfi, bahwa : “Belajar halal haram itu pokok, belajar sifat wajib-jaiz (Allah) itu kewajiban. Namun (santri) harus belajar kandungan Al-Qur’an yang juga berisi ilmu astronomi, antariksa, sebagaimana yang tersebut dalam surat Al-Qur’an,” jelas Habib Luthfi bin Hasyim bin Yahya dalam acara Maulid Nabi Muhammad SAW di Latak, Godong, Grobogan, Jawa Tengah Sebagai penutup dihari santri yang Indah ini, mari kita jadikan sebagai momentum untuk bangkit menjadi bangsa yang kuat di Ilmu Agama dan juga kuat dalam ilmu Duniawi. Jadi pada masa depan nanti, Indonesia akan dipimpin oleh pemimpin yang amanah,cerdas duniawinya dan juga bagus Ilmu Agamanya. Amiin ya Allah. Semarang, 22 Oktober 2016 Indra Kusuma","categories":[{"name":"story","slug":"story","permalink":"https://idindrakusuma.github.io/categories/story/"}],"tags":[{"name":"Santri","slug":"Santri","permalink":"https://idindrakusuma.github.io/tags/Santri/"},{"name":"Pondok","slug":"Pondok","permalink":"https://idindrakusuma.github.io/tags/Pondok/"}]},{"title":"Usaha Tidak Pernah Menghianati Hasil","slug":"Usaha-Tidak-Pernah-Menghianati-Hasil","date":"2016-11-15T06:36:15.000Z","updated":"2017-06-09T06:44:01.969Z","comments":true,"path":"2016/11/15/Usaha-Tidak-Pernah-Menghianati-Hasil/","link":"","permalink":"https://idindrakusuma.github.io/2016/11/15/Usaha-Tidak-Pernah-Menghianati-Hasil/","excerpt":"Sudah lama sekali saya tidak memberikan artikel atau berita apapun di blog saya ini. Mulai dari awal oktober kemarin sampai detik ini, banyak sekali kegiatan yang datang silir berganti. Pada bulan oktober kemarin selepas acara FLS 2016, kami melanjutkan beberapa proyek kecil - kecilan agar hasil pertemuan kami tidak sia - sia di FLS.","text":"Sudah lama sekali saya tidak memberikan artikel atau berita apapun di blog saya ini. Mulai dari awal oktober kemarin sampai detik ini, banyak sekali kegiatan yang datang silir berganti. Pada bulan oktober kemarin selepas acara FLS 2016, kami melanjutkan beberapa proyek kecil - kecilan agar hasil pertemuan kami tidak sia - sia di FLS. Dimotori oleh mas Jamal, kami memiliki proyek Startup yang kami beri nama Markir. Tim kami terdiri dari 3 orang, yaitu saya sendiri selaku CTO, mas Jamal selaku CEO dan mas Afka selaku CMO. Markir merupakan sebuah aplikasi Mobile Payment untuk retibusi parkir. Banyak hal yang mendasari kami buat membentuk startup ini. Alkhamdulillahnya, bulan oktober ada sebuah lomba Cfest (Creative Preneur Festival) yang diadakan oleh Kadin Jawa Tengah, Suara Merdeka, Pemkot Semarang &amp; Udinus. Lomba ini mencari ide &amp; protoype startup yang bergerak dibidang Kretatif atau sekarang lebih dikenal dengan istilah Teknopreneur. Tanpa berfikir panjang, kita mulai ikutan acara ini. Kami mulai sering ketemu nih, seminggu 2x buat bahas progress dari ide startup yang akan kita jalankan nantinya. Baik dari survey, cara monetize aplikasi, desain, dan prototype aplikasi, dan semuanya kami buat dalam sebauh proposal. Kami bertiga suka kumpul di PIP (Pusat Informasi Publik) kota semarang untuk brainstroming, cari internet &amp; lokasi yang nyaman. Tidak jarang kita pulang sampe larut malam untuk menyelesaikan proposal yang kita buat. Dan setelah 1 bulan kami membuat proposal Markir, kami siap buat mengikutkan Ide bisnis markir ini ke Cfest. Dan tibalah pada tanggal 4 November 2016, dan… Ide Bisnis kita masuk 5 besar dan berkesempatan untuk menjadi 3 terbaik dari peserta yang ada. Dari sini, kita mulai seriusin lagi proyek Markir ini, baik dari desain produk, aplikasi, konsep pembayaran, teknologi dan lain sebagainya. Semakin kesini, kita bertiga semakin sering bertemu buat Markir, dan dari kita sering punya gurauwan bahwa #BelumBolehTidur yang kita anggap sebagai pelecut semangat bahwa Startup itu ‘wani perih’. Alkhamdulillah ketika ada Expo di Cfest, stand kita selalu yang paling rame dari pengunjung. Baik dari mahasiswa, kalanagan profesional dan dari kalangan pemerintah. Mereka bilang bahwa ide kita unik, beda dari yang lain dan penuh tantangan. Dan pada akhirnya, kita mampu menjadi juara 2 pada CFEST kategori protoype. Kita tau bahwa ini bukan akhir dari usaha kita, tapi ini adalah AWAL dari sebuah langkah kesuksesan yang sudah kita rintis. Good jobs team! Lanjutkan !","categories":[{"name":"story","slug":"story","permalink":"https://idindrakusuma.github.io/categories/story/"}],"tags":[{"name":"Lomba","slug":"Lomba","permalink":"https://idindrakusuma.github.io/tags/Lomba/"},{"name":"Startup","slug":"Startup","permalink":"https://idindrakusuma.github.io/tags/Startup/"},{"name":"Prestasi","slug":"Prestasi","permalink":"https://idindrakusuma.github.io/tags/Prestasi/"}]}]}