{"meta":{"title":"Indra Kusuma","subtitle":"Student","description":"Seorang Mahasiswa Teknik Informatika UDINUS yang menyukai Web Development dan aktif sebagai aktivis kepemudaan FLS.","author":"Indra Kusuma","url":"https://idindrakusuma.github.io"},"pages":[{"title":"Tentang Indra Kusuma","date":"2017-06-08T13:15:23.000Z","updated":"2017-06-08T13:47:41.773Z","comments":true,"path":"About/index.html","permalink":"https://idindrakusuma.github.io/About/index.html","excerpt":"","text":"Hai Sobat ! Perkenalkan, saya Indra Kusuma biasa dipanggil “Indra” atau “Mas Indra”. Saat ini saya masih tercatat sebagai mahasiswa aktif jurusan Teknik Informatika (TI) Universitas Dian Nuswantoro Semarang. Saya merupakan seorang Web Developer, saya juga aktif diorganisasi Future Leader Summit. PendidikanPendidikan saya dimulai di MI Muhammadiyah 02 Rowosari, kemudian saya melanjutkan di SMP NU 09 Rowosari. Setelah itu, saya mengambil konsentrasi Teknik Komputer &amp; Jaringan di SMK Muhhamdiyah 03 Weleri dan Alkhamdulillah saya menjadi lulusan terbaik. dan saat ini saya masih memperjuangkan gelar sarjana komputer saya di Universitas Dian Nuswantoro Semarang. OrganisasiDari SMK, saya sudah aktif diberbagai Organisasi internal maupun ekternal dari kampus. Pengalaman organisasi saya dimulai di IPM (Ikatan Pelajar Muhammadiyah). Waktu itu jabatan tertinggi saya jadi Ketua Ilmu Pengetahuan dan Pengembangandan gebrakan saya waktu itu adalah menerbitkan majalah kampus di SMK Muhammadiyah 3 Weleri. Ditingkat pendidikan kampus, saya aktif diberbagai organisasi kampus baik Orma maupun UKM di Universitas Dian Nuwantoro (UDINUS). Saya pernah menjadi anggota aktif di HMTI (Himpunan Mahasiswa Teknik Informatika), Doscom (Dinus Open Source Community), DNCC (Dian Nuswantoro Computer Club) dan saat ini masih aktif sebagai Web Master di Future Leader Summit by Nusantara Muda. KemampuanSaya memiliki beberapa kemampuan, dan fokus saya di Web Development. saya menguasai PHP Codeigniter, Laravel, JavaScript, CSS, Wordpress dan berbagai CMS Blog seperti Blogger &amp; Hexo. Selain kemapuan web development, saya juga suka desain Presentasi dengan berbagai tools seperti Canva, Libre maupun Power point. Curiculum VitaeBisa donwload DISINI Informasi Kontak Whatsapp/Line/Telp/SMS/Telegram : +6289522248642 Email : indrakusuma.udinus@gmail.com ID LINE : indra.update Facebook : fb.com/id.indrakusuma Twitter : id_indrakusuma Instagram : @id.indrakusuma LinkedIn : https://www.linkedin.com/in/IDindrakusuma Github : https://github.com/idindrakusuma"}],"posts":[{"title":"Dengan Usaha Serba Ekstra, PKM-T Kami Dapat Pendanaan Dikti","slug":"Dengan-Usaha-Serba-Ekstra-PKM-T-Kami-Dapat-Pendanaan-Dikti","date":"2017-06-13T18:53:39.000Z","updated":"2017-06-13T18:57:36.418Z","comments":true,"path":"2017/06/14/Dengan-Usaha-Serba-Ekstra-PKM-T-Kami-Dapat-Pendanaan-Dikti/","link":"","permalink":"https://idindrakusuma.github.io/2017/06/14/Dengan-Usaha-Serba-Ekstra-PKM-T-Kami-Dapat-Pendanaan-Dikti/","excerpt":"PKM atau Program Kreatifitas Mahasiswa merupakan kompetensi bergengsi tingkat mahasiswa untuk mencurahkan segala bentuk kreatifitas untuk menjadikan Indonesia penuh dengan kreatifitas dan Inovasi. PKM sendiri ada 7 bidang yang terdiri dari PKM-GT atau Gagasan Tertulis, PKM-AI atau Artikel Ilmiah, PKM-K atau Kewirausahaan, PKM-P atau Penelitian, PKM-M atau Pengabdian Masyarakat, PKM-KC atau Karsa Cipta dan PKM-T atau Penerapan Teknologi.","text":"PKM atau Program Kreatifitas Mahasiswa merupakan kompetensi bergengsi tingkat mahasiswa untuk mencurahkan segala bentuk kreatifitas untuk menjadikan Indonesia penuh dengan kreatifitas dan Inovasi. PKM sendiri ada 7 bidang yang terdiri dari PKM-GT atau Gagasan Tertulis, PKM-AI atau Artikel Ilmiah, PKM-K atau Kewirausahaan, PKM-P atau Penelitian, PKM-M atau Pengabdian Masyarakat, PKM-KC atau Karsa Cipta dan PKM-T atau Penerapan Teknologi. Pada tahun 2015 kemaren, waktu saya masih semester 3 saya dan teman - teman mencoba untuk ikut serta dalam program tahunan yang diadakan oleh Ristekdikti atau pemerintah tersebut. Setelah mencari berbagai masalah yang ada disekitar kampus maupun desa kami masing - masing. Akhirnya kami menemukan masalah pada suatu Kelompok Petani Tambak (KPT) Mina Abadi yang terletak didukuh Tegal Rejo Desa Rowosari, dimana dikelompok tersebut memiliki problem atau masalah mengenai pemberian pakan lele yang tidak teratur. “Mengetahui saja tidak cukup; kita harus menerapkan. Keinginan saja tidak cukup; kita harus melakukan.” – Johann Wolfgang von Goethe Berbekal ilmu pengetahuan elekro yang sederhana karena kami anak Teknik Informatika, Tim kami yang beranggotakan saya sendiri, Reza Maftazani, Enggar Adji Laksono dan senior kami mas Cahyo Tri Martanto mencoba mencari ide untuk menyelesaikan masalah tersebut dan munculah gagasan membuat alat yang kami namai AFF System atau Automatic Feeding Fish System. Alat ini dirancang untuk bisa memberikan pakan ikan tambak secara teratur dan bisa diatur sesuai dengan keinginan pemilik Tambak. Akhirnya, setelah susah payah saat melakukan brainstorming yang cukup panjang, saya sebagai ketua tim mengajukan ide tersebut melalui kegiatan PKM. Setelah itu, mulailah kita mencari pembimbing yang kompeten dalam bidang ini, dan munculah berbagai nama dari dosen Fakultas Ilmu Komputer maupun Teknik. Tetapi pada akhirnya kami memilih dosen fakultas teknik karena pada dasarnya mereka lebih tahu mengenai hal semacam ini dari pada dosen fasilkom yang basisnya lebih ke software. Pak Jazuli, M. Eng adalah dosen pembimbing kami dari Fakultas Teknik UDINUS. Setelah kita konsultasi yang pada awalnya kita ingin ikut serta dalam PKM-KC tetapi lebih disarankan oleh pak Jaz (Sapaan dosbing kami) untuk mengajukan ide tersebut di PKM-T saja. Hal tersebut diambil karena kami memiliki real problem yang dialami oleh kelompok mitra. Setelah itu, mulailah saya sebagai ketua kelompok menyusun proposal PKM-T. Kami browsing, mencari literatur dan berbagai sumber dari contoh PKM yang berhasil didanai, Kemudian kami mencari bentuk teknologi yang pas yang bisa diterapkan sesuai dengan problem tersebut. Setelah hampir satu minggu, saya berhasil menyusun PKM-T kami. Tapi… Itu bukan akhir dari kegiatan ini, tentu saja masih banyak challenge atau tantangan harus kami selesaikan yaitu Revisi penulisan dari dosbing. Maklum, ini merupakan pertama kalinya kami membuat PKM. Terhitung PKM-T kami mengalami revisi yang cukup banyak, dari revisi penulisan judul, logo, gambar, kalimat yang ambigu, penulisan format yang tidak sesuai, informasi yang tidak tepat dan yang lain sebagainya. Tetapi, hal tersebut malah mebuat kami semakin tambah semangat dalam menjalankan misi mulia ini, hehehe. Dan pada akhirnya, pada bulan september 2015 PKM-T kami telah siap untuk diupload ke webiste Simlitabnas dan siap masuk untuk bersaing dengan ratusan ribu proposal PKM dari seluruh Indonesia. Setelah menunggu lama, pada februari 2016 kami mendengar kabar yang cukup istimewa ! ya ! PKM-T Kami lolos ! Hal tersebut bukan tanpa alasan, selain dari problem yang kami angkat cukup baik kami juga tidak mudah menyerah dalam mengahadapi tatangan - tantangan yang ada. Tetapi, ini belum berakhir ! ini masih tahap awal, kita masih harus membuat alat AFF System ini dan kita harus implementasi ke mitra kami. Tetapi jika saya ceritakan semuanya disini, saya rasa terlalu panjang pembahasanya hehehe, lain kali saya sampaikan ya ? cukup sekian dan terima kasih.","categories":[{"name":"story","slug":"story","permalink":"https://idindrakusuma.github.io/categories/story/"},{"name":"kuliah","slug":"story/kuliah","permalink":"https://idindrakusuma.github.io/categories/story/kuliah/"},{"name":"portofolio","slug":"story/kuliah/portofolio","permalink":"https://idindrakusuma.github.io/categories/story/kuliah/portofolio/"}],"tags":[{"name":"prestasi","slug":"prestasi","permalink":"https://idindrakusuma.github.io/tags/prestasi/"},{"name":"PKM","slug":"PKM","permalink":"https://idindrakusuma.github.io/tags/PKM/"}]},{"title":"Kesan dan Pesan Menjadi Rangers FLS 2016","slug":"Kesan-dan-Pesan-Menjadi-Rangers-FLS-2016","date":"2017-06-10T14:55:39.000Z","updated":"2017-06-10T15:04:02.076Z","comments":true,"path":"2017/06/10/Kesan-dan-Pesan-Menjadi-Rangers-FLS-2016/","link":"","permalink":"https://idindrakusuma.github.io/2017/06/10/Kesan-dan-Pesan-Menjadi-Rangers-FLS-2016/","excerpt":"Halo selamat pagi Teman ! Masih tentang Future Leader Summit nih. Karena kemaren (16/10/2016) diminta buat memberikan kesan &amp; pesan sebagai rangers FLS 2016 sekalian aja saya buat tulisan di blog ini biar nanti para calon rangers FLS 2017 pada tertarik buat gabung, hehehe.","text":"Halo selamat pagi Teman ! Masih tentang Future Leader Summit nih. Karena kemaren (16/10/2016) diminta buat memberikan kesan &amp; pesan sebagai rangers FLS 2016 sekalian aja saya buat tulisan di blog ini biar nanti para calon rangers FLS 2017 pada tertarik buat gabung, hehehe. Kesan Sebagai Rangers FLS Kesan yang sangat luar biasa aku dapatkan sebagai rangers FLS 2016, baik dari rasa “cuek” ku ketika menjadi awal, dan ternyata hal tersebut cukup memberikan kekhawatiran cukup serius bagi direktur ku, dan project leaderku. Thanks direkturku, mas kukuh. Aku belajar banyak darimu dalam mengelola tim Creative &amp; IT FLS 2016. Gaya kepemimpinan yang nyantai tapi sesuai target, sering konyol - konyolan bareng dan tidak jarang kamu menjadi bahan bullyan kami, wkwkwk. Tetapi hal tersebutlah yang membuat tim Creative &amp; IT menjadi menyatu sebagai tim maupun sahabat, Good Jobs Director ! Thanks buat Mbak Glen sebagai Project Leader yang istimewa ! Salah satu hal yang aku pelajari dari mbak glen adalah pendekatan melalui private chatnya kepada setiap rangers. Hal ini membuat rangers FLS merasa dibutuhkan dan diperhatikan. Hal tersebut yang membuatku berubah yang awalnya hanya sekedar buat nambah CV doang, menjadi bener - bener sayang sama acara FLS 2016. Rekan IT &amp; Creative Camp yang istimewa dengan berbagai kemampuan kalian yang luar biasa, dari mas Tri, Afka, Agri, Mas Jefri dan mas Kukih. This is Amazing team ! Dan kepada semua rangers FLS, baik dari Marketing, PID, Comm, Logistic, Program dan lainnya ! kalian luar biasa. Aku sangat bersyukur bisa berkolaborasi dengan kalian para Pemuda serta Aktivis kampus yang luar biasa! Pesan Untuk FLS 2017 Sebelumnya saya ucapkan Selamat kepada mas Jama Radifan yang terpilih menjadi Project Leader FLS 2017. Dan karena kita buat project bareng diluar FLS, kemungkinan besar aku juga ditarik mas jamal tetep stay di FLS 2017. Karena FLS 2016 memberikan impact yang luar biasa kepada para delegates FLS 2016 dari berbagai wilayah diseluruh Indonesia. Semoga hal tersebut bisa dipertahankan dan ditingkatkan lagi untuk FLS 2017. Semakin tambah baik lagi, semakin luar biasa lagi dalam memberikan impact positif kepada para delegates, rangers maupun pembicara. Bravo FLS ! Sekian dulu dari saya, FLS cukup istimewa ! tidak ada rugi - ruginya sama sekali ! banyak pelajaran, banyak ilmu, banyak relasi dan keluarga baru tentunya. Sampai Jumpa !","categories":[{"name":"story","slug":"story","permalink":"https://idindrakusuma.github.io/categories/story/"}],"tags":[{"name":"FLS","slug":"FLS","permalink":"https://idindrakusuma.github.io/tags/FLS/"}]},{"title":"IT Management System UKM BAI","slug":"IT-Management-System-UKM-BAI","date":"2017-06-09T11:15:27.000Z","updated":"2017-06-09T11:23:27.036Z","comments":true,"path":"2017/06/09/IT-Management-System-UKM-BAI/","link":"","permalink":"https://idindrakusuma.github.io/2017/06/09/IT-Management-System-UKM-BAI/","excerpt":"Salah satu project penting pada semester 5 adalah saya mampu menyelesaikan ITMS UKM BAI (Information Technology Management System Unit Kegiatan Mahasiswa Badan Amalan Islam). Singkatnya sih, ini merupakan portal informasi sekaligus aplikasi manajemen organisasasi untuk UKM BAI.","text":"Salah satu project penting pada semester 5 adalah saya mampu menyelesaikan ITMS UKM BAI (Information Technology Management System Unit Kegiatan Mahasiswa Badan Amalan Islam). Singkatnya sih, ini merupakan portal informasi sekaligus aplikasi manajemen organisasasi untuk UKM BAI. Proyek ini awalnya saya tujukan untuk UKM BAI, tapi karena pada semester 5 banyak proyek akhir, ya sekalian saja saya jadikan tugas matakuliah Rekayasa Perangkat Lunak-Lanjut, Sistem basis Data, Management Proyek dan Pemrograman Internet. Mantep gak ? hehehe Untuk sementara, source code nya close source dulu. Karena hal ini berkaitan dengan BAI. Tetapi tidak lama lagi, insyaAllah saya publish versi umumnya agar temen - temen juga ikut ngembangin melalui repo saya di github. Oke, berikut merupakan spesifikasi singkat ITMS UKM BAI yang telah saya buat : Demo : http://bai.dinus.ac.id/ Framework : PHP Codeigniter v.3.1.4 Landing Page Template : Modified from w3layouts.com Admin Template : AdminLTE Database : MySQL Kalau temen - temen UKM mau bikin portal atau aplikasi managemen serupa, temen bisa kontak saya. terima kasih :)","categories":[{"name":"portofolio","slug":"portofolio","permalink":"https://idindrakusuma.github.io/categories/portofolio/"}],"tags":[{"name":"website","slug":"website","permalink":"https://idindrakusuma.github.io/tags/website/"},{"name":"project","slug":"project","permalink":"https://idindrakusuma.github.io/tags/project/"},{"name":"prestasi","slug":"prestasi","permalink":"https://idindrakusuma.github.io/tags/prestasi/"}]},{"title":"Bingung Pilih RPL-D atau SC (Sistem Cerdas) ?","slug":"Bingung-Pilih-RPL-D-atau-SC-Sistem-Cerdas","date":"2017-06-09T10:58:09.000Z","updated":"2017-06-09T11:09:54.624Z","comments":true,"path":"2017/06/09/Bingung-Pilih-RPL-D-atau-SC-Sistem-Cerdas/","link":"","permalink":"https://idindrakusuma.github.io/2017/06/09/Bingung-Pilih-RPL-D-atau-SC-Sistem-Cerdas/","excerpt":"Teknik Informatika merupakan disiplin ilmu yang menginduk pada ilmu komputer, yang pada dasarnya merupakan kumpulan disiplin ilmu dan teknik yang secara khusus menangani masalah transformasi atau pengolahan fakta-fakta simbolik (data) dengan memanfaatkan seoptimal mungkin teknologi komputer. Beberapa universitas di Indonesia, disiplin ilmu Teknik Informatika masih dipecah lagi untuk menentukan Minat Studi Mahasiswa. Minat Studi ?","text":"Teknik Informatika merupakan disiplin ilmu yang menginduk pada ilmu komputer, yang pada dasarnya merupakan kumpulan disiplin ilmu dan teknik yang secara khusus menangani masalah transformasi atau pengolahan fakta-fakta simbolik (data) dengan memanfaatkan seoptimal mungkin teknologi komputer. Beberapa universitas di Indonesia, disiplin ilmu Teknik Informatika masih dipecah lagi untuk menentukan Minat Studi Mahasiswa. Minat Studi ? Minat Studi Mahasiswa merupakan wadah edukasi yang mengarahkan belajar mahasiswa untuk lebih fokus dan terarah sesuai peminatan dari mahasiswa itu sendiri, berdasarkan kurikulum yang berlaku untuk mencapai visi dan misi program studi. Di Universitas Dian Nuswantoro (UDINUS), mulai dari semester 5, kita harus menentukan minat studi sesuai dengan passion dan biasanya kita harus memilih minat studi saat Input KRS Semester 5. Jangan asal pilih ! mengapa ? karena 4 semester kedepan akan menentukan Tugas Akhir/Skripsi yang akan kamu kerjakan. Di UDINUS sendiri, Teknik Informatika saat ini memiliki 2 minat studi, yaitu minat RPL-D (Rekayasa Perangkat Lunak dan Desain) dan SC (Sistem Cerdas). Apa itu ? terus harus pilih yang mana ? bingung ? Pada artikel ini, saya ingin menggambarkan sedikit mengenai RPL-D dan Sistem Cerdas sehingga temen - temen tidak salah pilih dalam menentukan peminatan. RPL-D RPL-D mempunyai area penelitian yang mencakup bidang seperti, Software Engineering (Software: Lifecycle, Management, Engineering Process, Engineering Tools and Methods), Programming (Programming Methodology and Paradigm), Data Engineering, Data and Knowledge level Modeling, Information Management (DB) practices, Knowledge Based Management System, Data mining, Knowledge Discovery in Database, Pemodelan Struktur Data, OOP , Optimasi Basisdata, Simulasi Dan Pemodelan, Rekayasa Perangkat Lunak, Data warehousing, Bussines Intelegence, Cloud Computing, Web Services, Service Oriented ArchitectureText Mining &amp; Document Clustering, Object Oriented and Temporal Database, Distribute Database, dan yang serumpun. Sistem Cerdas Sedangkan pada Sistem Cerdas dapat mencakup bidang-bidang:Waktu Nyata, Kombinatorik, Simulasi, Metode Numeris, Matematika Diskrit, Program Liner, Optimasi, Kecerdasan Buatan, Sistem Pakar, Pengolahan Citra, Algoritma Genetik, Natural Language Processing, Cognitive Systems, Simulation System, Intelligent Agent, Analysis Algorithm dan sebagainya yang serumpun. Terus bagaimana caranya agar saya tidak salah memilih ? Dari lingkup penelitian yang telah dijabarkan diatas, kita bisa menarik kesimpulan bahwa jika Anda kuat dalam hal logika, kuat dalam matematika dan sedikit lemah pada saat coding, Anda disarankan untuk memilih Sistem Cerdas Dan jika Anda lebih kuat dalam Coding, Implementasi Sistem dan suka dengan database, Anda disarankan untuk memilih minat Studi RPL-D. Kalau Mas Indra Sendiri Ambil Minat Studi Apa ? Karena lebih suka dalam implementasi algoritma (bukan bikin algoritma), suka desain web dan lebih suka koding, saya ambil peminatan RPL-D. Semoga artikel singkat ini bisa menjawab pertanyaan Anda. Mohon maaf bila tulisan saya masih sulit untuk dipahami, karena saya juga masih tahap belajar. Jika temen-temen masih pada bingung bisa dikolom komentar ya :)","categories":[{"name":"kuliah","slug":"kuliah","permalink":"https://idindrakusuma.github.io/categories/kuliah/"}],"tags":[{"name":"RPL","slug":"RPL","permalink":"https://idindrakusuma.github.io/tags/RPL/"}]},{"title":"Selamat Hari Santri Nasional yang Ke-2!","slug":"hari-santri","date":"2017-05-22T05:49:13.000Z","updated":"2017-06-09T06:07:34.351Z","comments":true,"path":"2017/05/22/hari-santri/","link":"","permalink":"https://idindrakusuma.github.io/2017/05/22/hari-santri/","excerpt":"22 Oktober merupakan Hari Santri Nasional bagi Negera Tercinta, Indonesia. Hal ini sesuai dengan keppres nomor 22 tahun 2015 tentang penetapan 22 oktober merukan Hari Santri Nasional. Nah, hari ini (22/10/2016) kami santri Pondok Raudhatul Qur’an Annasimiyyah memperingati Hari Santri Nasional dengan mengikuti serangkain acara yang diselenggarakan oleh Pemerintah Kota Semarang dan berbagai Ormas Islam diwilayah Semarang.","text":"22 Oktober merupakan Hari Santri Nasional bagi Negera Tercinta, Indonesia. Hal ini sesuai dengan keppres nomor 22 tahun 2015 tentang penetapan 22 oktober merukan Hari Santri Nasional. Nah, hari ini (22/10/2016) kami santri Pondok Raudhatul Qur’an Annasimiyyah memperingati Hari Santri Nasional dengan mengikuti serangkain acara yang diselenggarakan oleh Pemerintah Kota Semarang dan berbagai Ormas Islam diwilayah Semarang.Hari Santri ? Mengapa harus diperingati secara Nasional ? Kita semua tahu, bahwa lahirnya bangsa Indonesia tidak terlepas dari peran para ulama terdahulu, sebut saja K.H Hasyim Asyari, K.H Ahmad Dahlan dan para tokoh yang lain. Oleh karena itu, sudah sepantasnya kita memperingari hari santri. Terus, Kenapa pada 22 Oktober ? Hal tersebut merujuk pada peristiwa bersejarah yang membawa bangsa Indoensia meraih kemerdekaan dari para penjajah. Resolusi jihad yang dicetuskan oleh Pendiri NU KH. Hasyim Asy’ari pada tanggal 22 oktober tahun 1945 di Surabaya untuk mencegah kembalinya tentara kolonial belanda yang mengatasnamakan NICA. KH. Hasyim Asy’ari sebagai ulama pendiri NU menyerukan jihad dengan mengatakan bahwa “Membela tanah air dari penjajah hukumnya fardlu’ain atau wajib bagi setiap individu“. Oke, memangnya mas Indra Santri ? Kan udah saya tulis dipembukaan tadi, bahwa saya santri dari PPRQ Annasimiyyah dan diasuh Abah Hanif Ismail, LC. Jadi sudah jelas saya juga santri, hehehe. Oh iya ya, terus terus.. Mas Indra kan mahasiswa dan santri nih ? ceritain dong bagaimana prosesnya.. Nah ini nih yang paling penting, saya cerita sejarah saya sebelum mondok di PPRQ dulu ya. Sebenernya waktu awal kuliah dulu niatanya cuma pengen kuliah dan berorganisasi yang baik dan nyari sambilan buat bantuin orang tua bayar kuliah. Oleh karena itu dulu saya Ngekost, tapi ngekostnya cari yang bareng sama pekerja bukan sesama mahasiswa. Dulu ngekost 1 kamar dua orang yaitu saya dan teman saya Umam jadi bayarnya patungan gitu, Cuma si Umam disemester kedua tidak lanjut kuliah, dia lebih memilih wirausaha, nah waktu itu juga saya bingung nih, udah kuliah bayarnya mahal, ditambah biaya kost yang mahal yang harus ditanggung sendiri. Nah, waktu itu saya mau pindah terus cari yang murah - murah aja. yang bayarnya 200rb/bulan atau dibawahnya dan ketemulah si M Nurul Irfan, dia merupakan teman kelas sekaligus rekan komunitas DOSCOM. Dia memberitahu saya bahwa dia mondok di PPRQ dan biaya perbulanya cuma 60 ribu, masyaAllah murah banget kan. Waktu itu karena saya juga butuh yang murah saya langsung main dipondoknya irfan buat cek tempat. Tetapi saat saat pertama kali cek tempat, saya ngelus dada. Karena waktu itu satu kamar di isi 3 orang dan 4 sama saya. Tapi karena kebutuhan mendesak, udah mondok aja. Bismillah Dulu pas niat mau mondok ijin sama orang tua mas ? langsung dibolehin ? Dulu waktu mau mondok, bilang sama kedua orang tua malah langsung didukung. Cuma.. dulu posisinya saya masih hidup dizaman jahiliyah, ya saya dulu pacaran dan bangga (Astagfiruallah). Dulu dapet sendikit kontra nih sama mantan saya, tapi saya niat aja, bahwa saya juga sekalian mau perbaiki diri dan ngaji saya, jadi saya harus mondok. Dan Alkhamdulillah, setelah ngaji berbagai kitab fiqih, tafsir dan qur’an selama kurang dari 2 bulan, Saya diberi kekuatan sama Allah untuk berani memutuskan pacar saya (Alkhamdulillah..) Owalah.. nah terakhir nih mas. Kamu kan Aktivis juga nih, bagimana sih kondisi mahasiswa/pemuda Indonesia ? benarkah kekurangan orang pinter ? Wah pertanyaanya susah hehehe, tapi coba saya jawab dengan pengetahuan saya ya. Bismillah, jadi gini, Indonesia merupakan bangsa besar, sumber daya alam dan manusianya cukup habat. Kekurangan Orang pinter ? saya rasa tidak ! kamu bisa lihat berbagai kompetisi internasional, seperti fisika, matematika dan juaranya siapa ? Indonesia. Jadi untuk tingkat kepintaran, Indonesia jelas tidak kekurangan. Tapi, Indonesia kekurangan orang jujur dan beraklaq. Mereka yang korupsi jelas bukanlah orang bodoh. Mereka pintar dan sangat pintar tapi akhlaq dan iman mereka kosong ! nah, disini peran pendidikan agama sangatlah penting, oleh karena itu, tidak cukup belajar ilmu duniawi saja, harus belajar ilmu agama juga. Oleh karena itu,Santri yang notabenya ilmu agamanya baik, harus belajar ilmu duniawi yang baik juga, seperti yang dikatakan oleh Habib Luthfi, bahwa : “Belajar halal haram itu pokok, belajar sifat wajib-jaiz (Allah) itu kewajiban. Namun (santri) harus belajar kandungan Al-Qur’an yang juga berisi ilmu astronomi, antariksa, sebagaimana yang tersebut dalam surat Al-Qur’an,” jelas Habib Luthfi bin Hasyim bin Yahya dalam acara Maulid Nabi Muhammad SAW di Latak, Godong, Grobogan, Jawa Tengah Sebagai penutup dihari santri yang Indah ini, mari kita jadikan sebagai momentum untuk bangkit menjadi bangsa yang kuat di Ilmu Agama dan juga kuat dalam ilmu Duniawi. Jadi pada masa depan nanti, Indonesia akan dipimpin oleh pemimpin yang amanah,cerdas duniawinya dan juga bagus Ilmu Agamanya. Amiin ya Allah. Semarang, 22 Oktober 2016 Indra Kusuma","categories":[{"name":"story","slug":"story","permalink":"https://idindrakusuma.github.io/categories/story/"}],"tags":[{"name":"Santri","slug":"Santri","permalink":"https://idindrakusuma.github.io/tags/Santri/"},{"name":"Pondok","slug":"Pondok","permalink":"https://idindrakusuma.github.io/tags/Pondok/"}]},{"title":"Usaha Tidak Pernah Menghianati Hasil","slug":"Usaha-Tidak-Pernah-Menghianati-Hasil","date":"2016-11-15T06:36:15.000Z","updated":"2017-06-09T06:44:01.969Z","comments":true,"path":"2016/11/15/Usaha-Tidak-Pernah-Menghianati-Hasil/","link":"","permalink":"https://idindrakusuma.github.io/2016/11/15/Usaha-Tidak-Pernah-Menghianati-Hasil/","excerpt":"Sudah lama sekali saya tidak memberikan artikel atau berita apapun di blog saya ini. Mulai dari awal oktober kemarin sampai detik ini, banyak sekali kegiatan yang datang silir berganti. Pada bulan oktober kemarin selepas acara FLS 2016, kami melanjutkan beberapa proyek kecil - kecilan agar hasil pertemuan kami tidak sia - sia di FLS.","text":"Sudah lama sekali saya tidak memberikan artikel atau berita apapun di blog saya ini. Mulai dari awal oktober kemarin sampai detik ini, banyak sekali kegiatan yang datang silir berganti. Pada bulan oktober kemarin selepas acara FLS 2016, kami melanjutkan beberapa proyek kecil - kecilan agar hasil pertemuan kami tidak sia - sia di FLS. Dimotori oleh mas Jamal, kami memiliki proyek Startup yang kami beri nama Markir. Tim kami terdiri dari 3 orang, yaitu saya sendiri selaku CTO, mas Jamal selaku CEO dan mas Afka selaku CMO. Markir merupakan sebuah aplikasi Mobile Payment untuk retibusi parkir. Banyak hal yang mendasari kami buat membentuk startup ini. Alkhamdulillahnya, bulan oktober ada sebuah lomba Cfest (Creative Preneur Festival) yang diadakan oleh Kadin Jawa Tengah, Suara Merdeka, Pemkot Semarang &amp; Udinus. Lomba ini mencari ide &amp; protoype startup yang bergerak dibidang Kretatif atau sekarang lebih dikenal dengan istilah Teknopreneur. Tanpa berfikir panjang, kita mulai ikutan acara ini. Kami mulai sering ketemu nih, seminggu 2x buat bahas progress dari ide startup yang akan kita jalankan nantinya. Baik dari survey, cara monetize aplikasi, desain, dan prototype aplikasi, dan semuanya kami buat dalam sebauh proposal. Kami bertiga suka kumpul di PIP (Pusat Informasi Publik) kota semarang untuk brainstroming, cari internet &amp; lokasi yang nyaman. Tidak jarang kita pulang sampe larut malam untuk menyelesaikan proposal yang kita buat. Dan setelah 1 bulan kami membuat proposal Markir, kami siap buat mengikutkan Ide bisnis markir ini ke Cfest. Dan tibalah pada tanggal 4 November 2016, dan… Ide Bisnis kita masuk 5 besar dan berkesempatan untuk menjadi 3 terbaik dari peserta yang ada. Dari sini, kita mulai seriusin lagi proyek Markir ini, baik dari desain produk, aplikasi, konsep pembayaran, teknologi dan lain sebagainya. Semakin kesini, kita bertiga semakin sering bertemu buat Markir, dan dari kita sering punya gurauwan bahwa #BelumBolehTidur yang kita anggap sebagai pelecut semangat bahwa Startup itu ‘wani perih’. Alkhamdulillah ketika ada Expo di Cfest, stand kita selalu yang paling rame dari pengunjung. Baik dari mahasiswa, kalanagan profesional dan dari kalangan pemerintah. Mereka bilang bahwa ide kita unik, beda dari yang lain dan penuh tantangan. Dan pada akhirnya, kita mampu menjadi juara 2 pada CFEST kategori protoype. Kita tau bahwa ini bukan akhir dari usaha kita, tapi ini adalah AWAL dari sebuah langkah kesuksesan yang sudah kita rintis. Good jobs team! Lanjutkan !","categories":[{"name":"story","slug":"story","permalink":"https://idindrakusuma.github.io/categories/story/"}],"tags":[{"name":"Lomba","slug":"Lomba","permalink":"https://idindrakusuma.github.io/tags/Lomba/"},{"name":"Startup","slug":"Startup","permalink":"https://idindrakusuma.github.io/tags/Startup/"},{"name":"Prestasi","slug":"Prestasi","permalink":"https://idindrakusuma.github.io/tags/Prestasi/"}]}]}