{"meta":{"title":"Indra Kusuma","subtitle":"Student","description":"I'm Student!","author":"Indra Kusuma","url":"https://idindrakusuma.github.io"},"pages":[{"title":"Tentang Indra Kusuma","date":"2017-06-08T13:15:23.000Z","updated":"2017-06-08T13:47:41.773Z","comments":true,"path":"About/index.html","permalink":"https://idindrakusuma.github.io/About/index.html","excerpt":"","text":"Hai Sobat ! Perkenalkan, saya Indra Kusuma biasa dipanggil “Indra” atau “Mas Indra”. Saat ini saya masih tercatat sebagai mahasiswa aktif jurusan Teknik Informatika (TI) Universitas Dian Nuswantoro Semarang. Saya merupakan seorang Web Developer, saya juga aktif diorganisasi Future Leader Summit. PendidikanPendidikan saya dimulai di MI Muhammadiyah 02 Rowosari, kemudian saya melanjutkan di SMP NU 09 Rowosari. Setelah itu, saya mengambil konsentrasi Teknik Komputer &amp; Jaringan di SMK Muhhamdiyah 03 Weleri dan Alkhamdulillah saya menjadi lulusan terbaik. dan saat ini saya masih memperjuangkan gelar sarjana komputer saya di Universitas Dian Nuswantoro Semarang. OrganisasiDari SMK, saya sudah aktif diberbagai Organisasi internal maupun ekternal dari kampus. Pengalaman organisasi saya dimulai di IPM (Ikatan Pelajar Muhammadiyah). Waktu itu jabatan tertinggi saya jadi Ketua Ilmu Pengetahuan dan Pengembangandan gebrakan saya waktu itu adalah menerbitkan majalah kampus di SMK Muhammadiyah 3 Weleri. Ditingkat pendidikan kampus, saya aktif diberbagai organisasi kampus baik Orma maupun UKM di Universitas Dian Nuwantoro (UDINUS). Saya pernah menjadi anggota aktif di HMTI (Himpunan Mahasiswa Teknik Informatika), Doscom (Dinus Open Source Community), DNCC (Dian Nuswantoro Computer Club) dan saat ini masih aktif sebagai Web Master di Future Leader Summit by Nusantara Muda. KemampuanSaya memiliki beberapa kemampuan, dan fokus saya di Web Development. saya menguasai PHP Codeigniter, Laravel, JavaScript, CSS, Wordpress dan berbagai CMS Blog seperti Blogger &amp; Hexo. Selain kemapuan web development, saya juga suka desain Presentasi dengan berbagai tools seperti Canva, Libre maupun Power point. Curiculum VitaeBisa donwload DISINI Informasi Kontak Whatsapp/Line/Telp/SMS/Telegram : +6289522248642 Email : indrakusuma.udinus@gmail.com ID LINE : indra.update Facebook : fb.com/id.indrakusuma Twitter : id_indrakusuma Instagram : @id.indrakusuma LinkedIn : https://www.linkedin.com/in/IDindrakusuma Github : https://github.com/idindrakusuma"}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2017-06-08T10:13:06.631Z","updated":"2017-06-08T10:13:06.631Z","comments":true,"path":"2017/06/08/hello-world/","link":"","permalink":"https://idindrakusuma.github.io/2017/06/08/hello-world/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"hexo","slug":"hexo","permalink":"https://idindrakusuma.github.io/categories/hexo/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://idindrakusuma.github.io/tags/hexo/"},{"name":"github","slug":"github","permalink":"https://idindrakusuma.github.io/tags/github/"}]}]}